In [6]:
import numpy as np
import pandas as pd

In [7]:
d = {'A': ' foo foo foo bar bar bar'.split(),
     'B': ' one one two two one one'.split(),
     'C': 'x y x y x y'.split(),
     'D': [1,3,2,5,4,1]
    }

In [8]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [10]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN